[About Language File]
Version=12.3.1
Date=12.09.2016
Author=سيف الاسدي-saif alasadi
Email=saifxman10@yahoo.com
Comments=اذا وجدت خطأ في الترجمة اعلمني لاصلحه

[MainForm]
ActionDirectoryContextMenu:h=قائمة المحتويات
ActionDirectoryContextMenu=&قائمة المحتويات
ActionDirectoryDelete:h=حذف الملف او المجلد
ActionDirectoryDelete=&حذف
ActionDirectoryFindInFiles:h=ابحث عن سلسلة في الملفات المتعددة
ActionDirectoryFindInFiles=&اوجد داخل الملفات...
ActionDirectoryProperties:h=شاهد خصائص الملف او المجلد
ActionDirectoryProperties=&الخصائص...
ActionDirectoryRefresh:h=اعادة تحديث الملفات
ActionDirectoryRefresh=&اعادة تحديث
ActionDirectoryRename:h=اعد تسمية الملف\المجلد
ActionDirectoryRename=اعد &التسمية
ActionDocument=&المستندات
ActionDocumentFormat=صيغة
ActionDocumentFormatSQL:h=صيغة SQL
ActionDocumentFormatSQL=صيغة SQL
ActionDocumentFormatXML:h=صيغة XML
ActionDocumentFormatXML=&صيغة XML
ActionDocumentFormatJSON:h=صيغة JSON
ActionDocumentFormatJSON=&صيغة JSON
ActionDocumentFormatJSONMinify=تصغير
ActionDocumentFormatJSONIndent2=الطلب  2
ActionDocumentFormatJSONIndent3=الطلب  3
ActionDocumentFormatJSONIndent4=الطلب  4
ActionDocumentInfo:h=سطر, كلمة, وفرز الحروف
ActionDocumentInfo=&المعلومة...
ActionDocumentViewInBrowser:h=اظهر المستند الحالي في المتصفح الافتراضي
ActionDocumentViewInBrowser:s=Alt+B
ActionDocumentViewInBrowser=&اظهر في المتصفح
ActionEdit=&التعديل
ActionEditCopy:h=انسخ المحدد وضعهة في ذاكرة النصوص
ActionEditCopy:s=Ctrl+C
ActionEditCopy=نسخ
ActionEditCut:h=قص المحدد وضعه في ذاكرة النصوص
ActionEditCut:s=Ctrl+X
ActionEditCut=&قص
ActionEditDecreaseIndent:h=قطع النقصان
ActionEditDecreaseIndent:s=Shift+Ctrl+U
ActionEditDecreaseIndent=&التناقص
ActionEditDelete=&حذف
ActionEditDeleteEndOfLine:h=حذف نهاية السطر
ActionEditDeleteEndOfLine:s=Shift+Ctrl+Y
ActionEditDeleteEndOfLine=&نهاية السطر
ActionEditDeleteLine:h=حذف السطر
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=&السطر
ActionEditDeleteWhitespace:h=احذ النص المحدد
ActionEditDeleteWhitespace=&فراغ ابيض
ActionEditDeleteWord:h=حذف الكلمة
ActionEditDeleteWord:s=Ctrl+T
ActionEditDeleteWord=&الكلمة
ActionEditIncreaseIndent:h=قطع الزيادة
ActionEditIncreaseIndent:s=Shift+Ctrl+I
ActionEditIncreaseIndent=الارتفاع
ActionEditIndent=&قطع
ActionEditInsert=ادخال
ActionEditInsertDateTime:h=ادخال التاريخ والوقت
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=&التاريخ والوقت
ActionEditInsertLine:h=ادخال سطر
ActionEditInsertLine:s=Ctrl+Enter
ActionEditInsertLine=&السطر
ActionEditInsertTag:h=ادخال HTML/XML اشارة
ActionEditInsertTag:s=Shift+Ctrl+T
ActionEditInsertTag=&HTML/XMLاشارة...
ActionEditPaste:h=ادخال محتويات ذاكرة النصوص
ActionEditPaste:s=Ctrl+V
ActionEditPaste=&لصق
ActionEditRedo:h=اعد العمل السابق
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=&استعادة
ActionEditSelectAll:h=تحديد الكل
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=&تحديد الكل
ActionEditSort=&الترتيب
ActionEditSortAsc:h=ترتيب تصاعدي
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=&تصاعدي
ActionEditSortDesc:h=ترتيب تنازلي
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=&تنازلي
ActionEditToggleCase:h=تثبيت الكشف
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=&تبديل الحالة
ActionEditToggleCaseAlternating:h=تثبيت كشف التناوب
ActionEditToggleCaseAlternating=التناوب
ActionEditToggleCaseLower:h=تثبيت كشف الواطئ
ActionEditToggleCaseLower=واطئ
ActionEditToggleCaseSentence:h=تثبيت كشف الجملة
ActionEditToggleCaseSentence=الجملة
ActionEditToggleCaseTitle:h=تثبيت كشف العنوان
ActionEditToggleCaseTitle=العنوان
ActionEditToggleCaseUpper:h=تثبيت كشف العالي
ActionEditToggleCaseUpper=عالي
ActionEditUndo:h=الغاء الحدث الاخير
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=&الغاء العمل
ActionFile=&الملف
ActionFileClose:h=اغلاق المستند النشط
ActionFileClose:s=Ctrl+F4
ActionFileClose=&اغلاق
ActionFileCloseAll:h=اغلاق جميع الملفات
ActionFileCloseAll=&اغلاق الكل
ActionFileCloseAllOther:h=اغلق جميع الصفحات الاخرى
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=&اغلق جميع الاخرى
ActionFileExit:h=اخرج من البرنامج
ActionFileExit:s=Alt+F4
ActionFileExit=&الخروج
ActionFileNew:h=انشئ مستند جديد
ActionFileNew:s=Ctrl+N
ActionFileNew=&جديد
ActionFileOpen:h=افتح مستند موجود
ActionFileOpen:s=Ctrl+O
ActionFileOpen=&افتح...
ActionFilePrint:h=اطبع مستند نشط
ActionFilePrint:s=Ctrl+P
ActionFilePrint=&طباعة...
ActionFilePrintPreview:h=عرض المستند النشط
ActionFilePrintPreview=&عرض الطابعة...
ActionFileProperties:h=شاهد خصائص الملف
ActionFileProperties=&الخصائص...
ActionFileReopen=&اعادة فتح
ActionFileReopenClear=&مسح
ActionFileSave:h=حفظ المستند النشط
ActionFileSave:s=Ctrl+S
ActionFileSave=&حفظ
ActionFileSaveAll:h=حفظ جميع المستندات
ActionFileSaveAll:s=Shift+Ctrl+S
ActionFileSaveAll=حفظ الكل
ActionFileSaveAs:h=حفظ المستند النشط باسم جديد
ActionFileSaveAs:s=Ctrl+Alt+S
ActionFileSaveAs=حفظ باسم...
ActionFileSelectFromDirectory:h=اختر من المجلد النشط
ActionFileSelectFromDirectory=اختر من المجلد
ActionHelp=&المساعدة
ActionHelpAboutEditBone:h=عرض معلومات عن البرنامج
ActionHelpAboutEditBone=&حول EditBone
ActionHelpCheckForUpdates:h=التحقق من التحديثات
ActionHelpCheckForUpdates=&التدقيق على التحديثات
ActionHelpVisitHomepage:h=زيارة EditBone الصفحة الرسمية - http://www.bonecode.com/
ActionHelpVisitHomepage=&زيارة الموقع الرسمي
ActionMacro=المختصر
ActionMacroOpen:h=افتح مع اختصار جديد
ActionMacroOpen=&افتح...
ActionMacroPause:h=توقيف مؤقت للمختصر
ActionMacroPause:s=Shift+Ctrl+R
ActionMacroPause=&توقف
ActionMacroPlayback:h=اعادة المختصر
ActionMacroPlayback:s=Shift+Ctrl+P
ActionMacroPlayback=&اعادة
ActionMacroRecord:h=تسجيل المختصر
ActionMacroRecord:s=Shift+Ctrl+R
ActionMacroRecord=&تسجيل
ActionMacroSaveAs:h=احفظ المختصر مع اسم جديد
ActionMacroSaveAs=&احفظ باسم...
ActionMacroStop:h=ايقاف تسجيل المختصر
ActionMacroStop:s=Shift+Ctrl+S
ActionMacroStop=&ايقاف
ActionOutputCloseAllOtherPages:h=اغلق الكل
ActionOutputCloseAllOtherPages=اغلق جميع الصفحات الاخرى
ActionOutputCopyAllToClipboard:h=انسخ الكل لذاكرة النصوص
ActionOutputCopyAllToClipboard=انسخ الجميع لذاكرة النصوص
ActionOutputCopySelectedToClipboard:h=استنساخ المحدد لذاكرة النصوص
ActionOutputCopySelectedToClipboard=انسخ المحدد لذاكرة النصوص
ActionOutputOpenAll:h=فتح جميع الملفات
ActionOutputOpenAll=&فتح الجميع
ActionOutputOpenSelected:h=فتح الملفات المحددة
ActionOutputOpenSelected=&فتح المحدد
ActionOutputClose:h=اغلق الصفحة الحالية
ActionOutputClose=&اغلاق
ActionOutputCloseAll:h=اغلق جميع الصفحات
ActionOutputCloseAll=اغلاق الكل
ActionOutputSelectAll:h=حدد جميع الملفات
ActionOutputSelectAll=تحديد الكل
ActionOutputUnselectAll:h=الغاء تحديد كل الملفات
ActionOutputUnselectAll=الغاء تحديد الكل
ActionSearch=&البحث
ActionSearchClearBookmarks:h=مسح جميع العلامات المرجعية
ActionSearchClearBookmarks=مسح العلامات
ActionSearchClose:h=اغلاق
ActionSearchFindInFiles:h=ابحث عن سلاسل في الملفات المتعددة
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=&اوجد في الملفات...
ActionSearchFindNext:h=اوجد النص المتطابق مع النص
ActionSearchFindNext:s=F3
ActionSearchFindNext=&اوجد التالي
ActionSearchFindPrevious:h=جد السابق المتطابق مع النص
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=&اوجد السابق
ActionSearchGoToBookmarks:h=اذهب الى العلامات المرجعية
ActionSearchGoToBookmarks=اذهب الى العلامات
ActionSearchGoToLine:h=اذهب الى السطر
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=اذهب الى السطر
ActionSearchOptions:h=خيارات البحث
ActionSearchReplace:h=استبدل النص الموجود بنص اخر
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=&استبدل...
ActionSearchSearchButton:h=ابحث عن النص المطلوب
ActionSearchSearch:s=Ctrl+F
ActionSearchSearchButton=&بحث...
ActionSearchToggleBookmark:h=اعداد او مسح العلامة في السطر الحالي. العلامات يمكن اعداداها ايضا ب by using Ctrl+Shift+1..9. اذهب الى العلامات Ctrl+1..9.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=&تبديل الاشارة المرجعية
ActionSearchToggleBookmarks:h=تثبيت العلامات المرجعية
ActionSearchToggleBookmarks=&تبديل الاشارات المرجعية
ActionToolbarMenuLanguage=&اللغة
ActionToolbarMenuSkin=&الغلاف...
ActionToolbarMenuView=&العرض
ActionTools=&الادوات
ActionToolsCharacterMap:h=ادخال رموز تشفير للمستند النشط بواسطة النقر المزدوج
ActionToolsCharacterMap=&لوحة الرموز المشفرة...
ActionToolsCompareFiles:h=قارن الملفات
ActionToolsCompareFiles=&موازنة الملفات..
ActionToolsConvert:h=تحويل بين الوحدات الرقمية
ActionToolsConvert=المحول...
ActionToolsLanguageEditor:h=محرر اللغة
ActionToolsLanguageEditor=&محرر اللغة...
ActionToolsOptions:h=اعادات الخيارات
ActionToolsOptions=&الاختيارات...
ActionToolsSelectForCompare:h=اختر مستند للمقارنة
ActionToolsSelectForCompare=اختر للموازنة...
ActionView=&العرض
ActionViewCloseDirectory:h=اغلق المجلد النشط
ActionViewCloseDirectory:s=Shift+Ctrl+D
ActionViewCloseDirectory=&اغلق المجلد
ActionViewColorSelection:h=اظهار او اخفاء محدد اللون
ActionViewColorSelection=اللون
ActionViewDirectory:h=اخفاء او اظهرا المجلد
ActionViewDirectory=&المجلد
ActionViewEditDirectory:h=تعديل المجلد النشط
ActionViewEditDirectory:s=Shift+Ctrl+E
ActionViewEditDirectory=&تعديل المجلد...
ActionViewEncodingSelection:h=اظهار او اخفاء محدد التشفير
ActionViewEncodingSelection=التشفير
ActionViewFiles:h=ابحث عن ملفات في المجلد وتفرعاته
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=&الملفات...
ActionViewHighlighterSelection:h=اخفاء او اظهار  الشفافية المحددة
ActionViewHighlighterSelection=&الشفافية
ActionViewLineNumbers:h=تبديل ارقام السطر
ActionViewLineNumbers=ارقام السطر
ActionViewMainMenu:h=اخفاء او اظهار القائمة
ActionViewMainMenu=القائمة الرئيسية
ActionViewMenuBar:h=اخفاء او اظهار شريط القائمة
ActionViewMenuBar=شريط القائمة
ActionViewMiniMap:h=اخفاء او اظهار الخريطة المصغرة
ActionViewMiniMap=خريطة مضغرة
ActionViewNextPage:h=اذهب الى الصفحة التالية
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=&الصفحة التالية
ActionViewOpenDirectory:h=افتح مجلد جديد
ActionViewOpenDirectory:s=Ctrl+D
ActionViewOpenDirectory=&افتح مجلد...
ActionViewOutput:h=اخفاء او اظهار المخرج
ActionViewOutput=&المخرج
ActionViewPreviousPage:h=اذهب الى الصفحة السابقة
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=&الصفحة السابقة
ActionViewSelectionMode:h=تثبيت وضع التحديد. وايضا اضغط على Alt والمحرر سوف يثبت وضع التحديد.
ActionViewSelectionMode=وضع التحديد
ActionViewSpecialChars:h=تثبيت رموز خاصة
ActionViewSpecialChars=&رموز خاصة
ActionViewSplit:h=شذب المستند
ActionViewSplit=&شذب
ActionViewSyncEdit=مزامنة التعديل
ActionViewSyncEdit:h=اظهار او اخفاء مزامنة العديل
ActionViewSyncEdit:s=Shift+Ctrl+J
ActionViewStatusBar:h=اظهار او اخفاء شريط الحالة
ActionViewStatusBar=&شريط الحالة
ActionViewToolbar:h=اظهار او اخفاء شريط الادوات
ActionViewToolbar=&شريط الادوات
ActionViewTitleBar=شريط العنوان
ActionViewTitleBarFilename=اسم الملف
ActionViewTitleBarFilename:h=اظههار او اخفاء اسم الملف من شريط العنوان
ActionViewTitleBarFileList=ملف القائمة
ActionViewTitleBarFileList:h=اظهار او اخفاء ملف القائمة من شريط العنان
ActionViewWordWrap:h=تبديل حالة التواء الكلمة
ActionViewWordWrap=&التواء الكلمة
ActionViewXMLTree:h=اظهار او اخفاء XML تفرعات
ActionViewXMLTree=&XML تفرع
ActionXMLTreeRefresh:h=تحديث XML تفرع
ActionXMLTreeRefresh=&تحديث
PanelDocument=يتم المعالجة...
ActionHelp:h=تمت الترجمة بواسطة سيف الاسدي

[AskYesOrNo]
ChangeColorFile=أنت بصدد تغيير ملف اللون الأصلي. إنشاء ملف جديد للالوان المعدلة?
CancelSearch=الغاء البحث, هل انت متأكد?
CloseDirectory=غلق المجلد %s,هل انت متأكد?
DeleteDirectory=حذف المجلد %s, هل انت متأكد?
DeleteFile=حذف الملف %s, هل انت متأكد?
DeleteLine=حذف الخط, هل انت متأكد?
DocumentTimeChanged=المستند %s's الوقت/التاريخ تم تغييره.اعادة تحميل?
NewVersion=اصدار جديد  %s of %sمتوفر.%sهل تريد تحميله من الانترنت?
RecordMacro=تسجيل اختصار جديد, هل انت متأكد?
ReplaceOccurence=استبدال هذا الملف المعطوب '%s'?
SaveChanges=حفظ التغييرات?
SearchMatchNotFound=لم يتم ايجاد بحث مطابق.%sاعد البحث من بداية الملف?
SearchStringNotFound=سلسلة البحث '%s' غير موجودة

[Message]
CannotFindString=لايمكن ايجاد السلسلة '%s'
DocumentStatistics=عدد الخطوط : %d%sعدد الكلمات: %d%sعدد الرموز: %d
LatestVersion=انت تستخدم اخر اصدار.
SelectFilePathFromDirectory=حدد مسار الملف من المجلد
NoDefaultPrinter=لاتوجد طابعة محددة يرجى التحديد.

[ErrorMessage]
EnterPath=ادخل المسار.
EnterTabName=ادخل اسم التبويب.
FileNotFound=الملف '%s' غير موجود.
PathNotExist=المسار غير موجود.
RootDirectoryNotExist=مجلد الجذر غير موجود.

[WarningMessage]
FileAccessError=الملف %s خطأ الوصول.

[Constant]
AllFiles=جميع الملفات
AllSkinsDownload=تحميل جميع الاغلفة
Arrow=المؤشر
AutoSave=حفظ تلقائي
Block=منع
Bookmark=العلامة
Bottom=الاسفل
Circle=دائرة
Color=لون
CompareFiles=موازنة الملفات
CountingFiles=احصاء الملفات...
DirectoryItems=عناصر المجلد
Document=مستند
Dot=نقطة
DownloadCancelling=يتم الالغاء...
DownloadDone=تم.
EditDirectory=تعديل المجلد
Encoding=التشفير
Enter=دخول
FileMaskItems=عناصر الملف الخفية
FilesFound=%d ملفات تم ايجادها في %s
FooterLeft=تذييل الصفحة - اليسار
FooterRight=تذييل الصفحة  - اليمين
GoToLine=اذهب للتخطيط
HalfBlock=نصف مجموعة
HeaderLeft=العنواني الرأسي - اليسار
HeaderRight=العنوان الرأسي - اليمين
Hide=اخفاء
Highlighter=شفافية عالية
HorizontalLine=خط افقي
Insert=ادخال
InsertTags=ادخال HTML/XML اشارات
InvalidName=اسم غير صالح
LanguageEditor=محرر اللغة - [%s]
Line=خط
MatchFound=%dمطابق%s وجد
MatchFoundPluralExtension=es
Minute=دق
Modified=تم التعديل
OccurencesFound=%d محطم(s) تم ايجاده في %s
Open=افتح
OpenDirectory=افتح مجلد
Overwrite=كتابة
Pilcrow=Pilcrow
Position=الموقع: %d
PreviewDocumentPage=الصفحة: $PAGENUM$ من $PAGECOUNT$
PreviewPage=الصفحة: %d of %d
PreviewPrintDocument=طبع (%s)|طبع المستند على %s
PrintedBy=تمت طباعته بواسطة %s
Rename=هل تريد اعادة تسمية %s to %s?
RenameFailed=%s فشلت اعادة التسمية
SaveAs=حفظ باسم
SearchFor=ابحث عن '%s'
SearchItems=عناصر البحث
Second=ثانية
SelectRootDirectory=تحديد مجلد الجذر
Solid=عريض
Square=مربع
TextToFindItems=اكتب لايجاد عناصر
ThinHorizontalLine=سطر افقي رفيع
ThinVerticalLine=سطر عمودي رفيع
Top=اعلى
TopLine=خط اعلى: %d
Triangle=Triangle
Triangle:t=Translation needed
VersionInfoNotFound=معلموات الاصدار غير موجودة.
VerticalLine=سطر عمودي

[DialogConstant]
SMsgDlgAbort=&احباط
SMsgDlgAll=&الجميع
SMsgDlgCancel=الغاء
SMsgDlgClose=&اغلاق
SMsgDlgConfirm=تأكيد
SMsgDlgError=خطأ
SMsgDlgHelp=&المساعدة
SMsgDlgHelpHelp=المساعدة
SMsgDlgHelpNone=لاتوجد مساعظة نتوفرة
SMsgDlgIgnore=&لا اهتم
SMsgDlgInformation=معلومات
SMsgDlgNo=&كلا
SMsgDlgNoToAll=&كلا للجميع
SMsgDlgOK=حسنا
SMsgDlgRetry=&اعد المحاولة
SMsgDlgWarning=تحذير
SMsgDlgYes=&نعم
SMsgDlgYesToAll=نعم &للجميع

[ColorConstant]
clBlack=الاسود
clMaroon=الكستنائي
clGreen=الاخضر
clOlive=الزيتوني
clNavy=الازرق الغامق
clPurple=البنفسجي
clTeal=الفستقي
clGray=الرصاصي
clSilver=الفضي
clRed=الاحمر
clLime=الليموني
clYellow=الاصفر
clBlue=الازرق
clFuchsia=الارجواني
clAqua=المائي
clWhite=الابيض
clMoneyGreen=اخضر غامق
clSkyBlue=سمائي
clCream=الابيض المائل للصفرة
clMedGray=رصاصي وسط
clActiveBorder=الحدود الغامقة
clActiveCaption=شرح غامق
clAppWorkSpace=مساحة التطبيق
clBackground=الخلفية
clBtnFace=وجهة الزر
clBtnHighlight=ابراز الزر
clBtnShadow=ظل الزر
clBtnText=نص الزر
clCaptionText=نص الشرح
clDefault=الافتراضي
clGradientActiveCaption=درجة الغمق الشرح
clGradientInactiveCaption=درجة الشفافية للشرح
clGrayText=نص رصاصي
clHighlight=خلفية بازرة
clHighlightText=نص بارز
clHotLight=ضوء سريع
clInactiveBorder=حدود شفافة
clInactiveCaption=شرح شفاف
clInactiveCaptionText=نص الشرح شفاف
clInfoBk=خلفية المعلومات
clInfoText=معلومات النص
clMenu=حلفية القائمة
clMenuBar=شريط القائمة
clMenuHighlight=ابراز القائمة
clMenuText=نص القائمة
clNone=لاشئ
clScrollBar=شريط التمرير
cl3DDkShadow=3D ظل غامق
cl3DLight=3D خفيف
clWindow=خلفية النافذة
clWindowFrame=اطار النافذة
clWindowText=نص النافذة
SColorBoxCustomCaption=تخصيص...

[FileTypes]
ActionScript=ActionScript files (*.as)
ASP=ASP files (*.asp)
Assembler 68HC11=68HC11 Assembler files (*.hc11;*.asc)
AutoIt v3=AutoIt files (*.au3)
AWK=AWK scripts (*.awk)
C#=C# files (*.cs)
C++=C++ files (*.cpp;*.hpp)
C=C files (*.c;*.h)
CoffeeScript=CoffeeScript files (*.coffee)
CSS=Cascading Stylesheet files (*.css)
D=D files (*.d;*.di)
Delphi Form Module=Delphi Form Module files (*.dfm)
Free Pascal=Free Pascal files (*.pp)
GLSL=GLSL files (*.glsl)
Go=Go files (*.go)
Groovy=Groovy files (*.groovy;*.gvy;*.gy;*.gsh)
HTML with Scripts=HTML files (*.html;*.htm)
INI=INI files (*.ini;*.lng)
Inno Setup=Inno Setup files (*.iss)
Java=Java files (*.java)
JavaScript=JavaScript files (*.js)
JSON=JSON files (*.json)
LaTex=LaTex files (*.lat;*.tex;*.lex)
Lisp=Lisp files (*.lisp)
Lua=Lua files (*.lua)
MATLAB=MATLAB files (*.matlab)
MS-DOS Batch=MS-DOS Batch files (*.bat;*.cmd)
Objective-C=Objective-C files (*.m)
Object Pascal=Pascal files (*.pas;*.dpr;*.dpk)
OCaml=OCaml files (*.ml)
Perl=Perl files (*.pl;*.pm;*.cgi)
PHP=PHP files (*.php;*.class;*.inc)
PowerShell=PowerShell files (*.ps1)
Python=Python files (*.py)
Ruby=Ruby files (*.rb;*.rbw)
Rust=Rust files (*.rc)
Scala=Scala files (*.scala)
SQL - Standard=SQL files (*.sql)
TclTk=Tcl/Tk files (*.tcl)
Text=Text files (*.txt)
UnrealScript=UnrealScript files (*.uc)
Visual Basic=Visual Basic files (*.vb;*.bas)
XML=XML files (*.xml;*.xsd;*.dtd;*.dproj;*.groupproj)
XSL=XSL files (*.xsl;*.xslt)
Macro=Macro files (*.mcr)|*.mcr
Language=Language files (*.lng)|*.lng

[ConfirmReplaceDialog]
ButtonCancel=الغاء
ButtonNo=&كلا
ButtonYes=&نعم
ButtonYesToAll=نعم &للجميع
Caption=تأكيد التغيير

[DownloadURLDialog]
ButtonCancel=الغاء
Caption=تحميل

[FindInFilesDialog]
ButtonCancel=الغاء
ButtonFind=&اوجد
Caption=اوجد في الملف
StickyLabelCaseSensitive=اكتشاف حالة الاحرف
StickyLabelIncludeSubdirectories=تضمين مجلدات فرعية
ComboBoxDirectory=مجلد
ComboBoxFileMask=ملف مخفي
ComboBoxTextToFind=نص لايجاد
GroupBoxOptions=الاختيارات
GroupBoxSearchDirectoryOptions=ابحث في خيارات المجلد

[InputQueryDialog]
ButtonOK=حسنا
ButtonCancel=الغاء

[ItemListDialog]
ActionInsert=ادخال
ActionInsert:h=ادخال عنصر
ActionDelete=حذف
ActionDelete:h=حذف عنصر
ActionClearAll=مسح الجميع
ActionClearAll:h=مسح جميع العناصر
ActionMoveUp=تحرك للاعلى
ActionMoveUp:h=حرك العناصر المحددة الى الاعلى
ActionMoveDown=تحريك للاسفل
ActionMoveDown:h=حرك العناصر المحددة الى الاسفل
ActionSort=ترتيب
ActionSort:h=رتب العناصر

[SearchOptionsDialog]
ButtonCancel=الغاء
ButtonOK=حسنا
StickyLabelBeepIfSearchStringNotFound=ملائمة اذا لم تكن سلاسل البحث موجودة
StickyLabelCaseSensitive=اكتشاف حالة الاحرف
StickyLabelEntireScope=كامل المجال
StickyLabelHighlightResult=نتائج الابراز
StickyLabelRegularExpression=التعبير القياسي
StickyLabelSearchOnTyping=بحث بواسطة النوع
StickyLabelSelectedOnly=المحدد فقط
StickyLabelShowSearchMatchNotFound=اظهار تطابق البحث غير موجود
StickyLabelShowSearchStringNotFound=اظهار سلسلة البحث غير موجود
StickyLabelWholeWordsOnly=الكلمات الكاملة فقط
StickyLabelWildCard=الرمز العام
StickyLabelWrapAround=التواء حول

[OptionsToolbarItemsDialog]
ButtonAdd=اضف
ButtonCancel=الغاء
Caption=اختر عناصر
VirtualDrawTreeAddItems:0=عناصر القائمة

[ReplaceDialog]
ButtonCancel=الغاء
ButtonFind=&اوجد
ButtonReplaceAll=&استبدال الجميع
Caption=استبدال
ComboBoxSearchFor=ابحث عن
GroupBoxOptions=اختيارات
GroupBoxReplaceIn=استبدال في
RadioButtonAllOpenFiles=جميع الملفات المفتوحة
RadioButtonDeleteLine=حذف الخط
RadioButtonReplaceWith=استبدال مع
RadioButtonWholeFile=الملف الكامل
StickyLabelCaseSensitive=اكتشاف حالة الاحرف
StickyLabelPromptOnReplace=أشر على الاستبدال
StickyLabelRegularExpression=تعبير قياسي
StickyLabelSelectedOnly=المحدد فقط
StickyLabelWholeWordsOnly=الكلمة الكاملة فقط
StickyLabelWildCard=الرمز العام

[SkinSelectDialog]
PanelPreviewArea=مساحة العرض
GroupBoxSkinColorization=تلوين الغلاف
LabelHueOffset=تعديل الشكل
LabelSaturation=الاشباع
LabelBrightness=السطوع
StickyLabelExtendedBordersMode=وضع امتداد الحدود
StickyLabelBlendOnMove=مزج الشكل عند التحرك
StickyLabelAllowGlowing=السماج بالتوهج

[ConvertForm]
Caption=تحويل بين الوحدات الرقمية
ComboBoxFrom=من
ComboBoxTo=الى
ComboBoxType=النوع
EditResult=النتيجة
EditValue=القيمة

[PrintPreviewDialog]
ActionColors:h=تثبيت الالوان
ActionColors=الالوان
ActionExit:h=مغادرة عرض الطباعة
ActionExit=الخروج
ActionFirst:h=اولا|اذهب الى الصفحة الرئيسية
ActionFirst=الاول
ActionHighlight:h=تثبيت البارز
ActionHighlight=بارز
ActionLast:h=اخرا|اذهب الى اخر الفحة
ActionLast=الاخير
ActionLineNumbers:h=تثبيت رقم الخط
ActionLineNumbers=رقم الخط
ActionNext:h=التالي|اذهب الى الصفحة التالية
ActionNext=التالي
ActionPrevious:h=السابق|اذهب الى الصفحة السابقة
ActionPrevious=السابق
ActionPrint:h=طبع|اطبع المستند
ActionPrint=طباعة
ActionWordWrap:h=تثبيت التواء الكلمة
ActionWordWrap=التواء الكلمة
ActionZoom:h=كبر|تكبير وتصغير
ActionZoom=تكبير
ActionZoomIn:h=تقريب
ActionZoomIn=تكبير
ActionZoomOut:h=تبعيد
ActionZoomOut=تصغير
Caption=عرض الطابعة

[SearchForFilesForm]
Caption=بحث عن ملفات
PanelSearchingFiles=يتم البحث عن ملفات...

[CompareFrame]
CopySelectionLeftAction:h=انسخ المحدد الى اليسار
CopySelectionRightAction:h=انسخ المحدد الى اليمين
FindNextDifferenceAction:h=جد الاختلاف التالي
LeftDocumentButtonClickAction:h=افتح مستند
LeftLabel=يسار السطر
OpenDocumentsLeftAction:h=افتح مستند
OpenDocumentsRightAction:h=افتح مستند
RefreshAction:h=تحديث المستند
RightDocumentButtonClickAction:h=افتح مستند
RightLabel=يمين السطر
SaveLeftGridAction:h=احفظ المستند
SaveRightGridAction:h=احفظ المستند

[OptionsCompareFrame]
StickyLabelIgnoreCase=تجاهل الكشف
StickyLabelIgnoreBlanks=تجاهل الفراغات

[OptionsEditorCaretFrame]
StickyLabelNonblinkingCaretEnabled=مفعل
StickyLabelRightMouseClickMovesCaret=ضغط الزر الايمن لتحريك علامة الادخال
StickyLabelVisible=مرئي
ColorBoxNonblinkingCaretBackground=لون الخلفية
ColorBoxNonblinkingCaretForeground=لون المقدمة
ComboBoxStylesInsertCaret=ادخال
ComboBoxStylesOverwriteCaret=كتابة
GroupBoxNonBlinkingCaret=علامة ادخال بدون ترميش
GroupBoxStyles=الاسلوب

[OptionsEditorCodeFoldingFrame]
StickyLabelFoldMultilineComments=طوي ملاحظات السطور المتعددة
StickyLabelHighlightIndentGuides=أبرز خطوط إرشاد البادئة
StickyLabelHighlightMatchingPair=أبرز زوج متطابق
StickyLabelShowCollapsedCodeHint=إظهار تلميح رمز التشعب
StickyLabelShowCollapsedLine=إظهار تشعب السطر
StickyLabelShowIndentGuides=إظهار خطوط إرشاد البادئة
StickyLabelShowTreeLine=Show tree line
StickyLabelShowTreeLine:t=Translation needed
StickyLabelUncollapseByHintClick=تمديدها من قبل تلميح نقرة
StickyLabelVisible=مرئي
ComboBoxMarkStyle=اسلوب العلامة
EditHintRowCount=تلميح احصاء الاسطر

[OptionsEditorColorFrame]
StickyLabelElementsAttributesBold=عريض
StickyLabelElementsAttributesItalic=مائل
StickyLabelElementsAttributesUnderline=اسفل الخط
StickyLabelSkinActiveLineBackground=خلفية السطر النشطة
StickyLabelSkinBackground=الخلفية
StickyLabelSkinBookmarkPanelBackground=خلفية لوحة العلامات المرجعية
StickyLabelSkinCodeFoldingBackground=رمز خلفية قابلة للطي
StickyLabelSkinCodeFoldingHintBackground=رمز الطي تلميح الخلفية
StickyLabelSkinCompletionProposalBackground=انهاء الخلفية المقترحة
StickyLabelSkinCompletionProposalSelectionBackground=إكمال اختيار اقتراح الخلفية
StickyLabelSkinForeground=المقدمة
StickyLabelSkinLeftMarginBackground=خلفية الحافة اليسرى
StickyLabelSkinSelectionBackground=الخلفية المحددة
StickyLabelSkinSelectionForeground=المقدمة المحددة
ColorComboBoxEditorColor=اللون
ColorComboBoxElementsBackground=الخلفية
ColorComboBoxElementsForeground=المقدمة
ComboBoxColor=الالوان
ComboBoxEditorElement=العناصر
ComboBoxElementsName=الاسم
ComboBoxHighlighter=ضوء عالي
DateEditDate=التاريخ
EditEmail=البريد الالكتروني
EditName=الاسم
EditVersion=الاصدار
GroupBoxAttributes=الخواص
LabelSkinDescription=استخدم لون الغلاف للعناصر المحددة
TabSheetAuthor=المؤلف
TabSheetEditor=المحرر
TabSheetElements=العناصر
TabSheetGeneral=العام
TabSheetUseSkinColor=استخدم لون الغلاف

[OptionsEditorCompletionProposalFrame]
StickyLabelCaseSensitive=اكتشاف حالة الاحرف
StickyLabelEnabled=مفعل
StickyLabelAutoInvoke=استناد تلقائي
ComboBoxShortcut=اختصار

[OptionsEditorFontFrame]
ComboBoxColor=اللون
ComboBoxElement=العنصر
EditFontSize=حجم الخط
FontComboBoxFont=الخط

[OptionsEditorLeftMarginFrame]
StickyLabelAutoSize=حجم تلقائي
StickyLabelShowAfterLastLine=اظهر بعد السطر الاخير
StickyLabelShowBookmarkPanel=اظهر لوحة العلامات المرجعية
StickyLabelShowBookmarks=اظهر العلامات المرجعية
StickyLabelShowInTens=اظهر بالعشرات
StickyLabelShowLeadingZeros=اظهر الاصفار الرئيسية
StickyLabelShowLineState=اظهر حالة السطر
StickyLabelVisible=مرئي
EditLineNumbersStartFrom=ابدء من
EditBookmarkPanelWidth=عرض لوحة العلامات المرجعية
EditWidth=العرض
GroupBoxLineNumbers=رقم السطر

[OptionsEditorMatchingPairFrame]
StickyLabelEnabled=مفعل
StickyLabelHighlightAfterToken=أبرز ما بعد المنطلق
StickyLabelHighlightUnmatched=أبرز ما لا نظير لها

[OptionsEditorMinimapFrame]
StickyLabelVisible=مرئي
StickyLabelShowBookmarks=إظهار الإشارات المرجعية
StickyLabelShowBorder=إظهار الحدود
StickyLabelShowIndentGuides=إظهار خطوط إرشاد البادئة
StickyLabelShowSearchResults=Show search results
StickyLabelShowSearchResults:t=Translation needed
StickyLabelShowShadow=إظهار الظل
StickyLabelUseBlending=استخدام المزج
StickyLabelInvertBlending=عكس المزج
ComboBoxAlign=المحاذاة
EditWidth=العرض

[OptionsEditorOptionsFrame]
StickyLabelAutoIndent=التلقائي
StickyLabelAutoSave=حفظ تلقائي
StickyLabelDragDropEditing=الإسقاط بالسحب ليتم تعديلها
StickyLabelDropFiles=ملقات الاسقاط
StickyLabelGroupUndo=التراجع عن المجموعة
StickyLabelTrimTrailingSpaces=تقليم المسافات الزائدة
StickyLabelUndoAfterSave=التراجع بعد حفظ
EditLineSpacing=تباعد الأسطر

[OptionsEditorRightMarginFrame]
StickyLabelVisible=مرئي
StickyLabelMouseMove=حركة الفأرة
StickyLabelShowMovingHint=اظهر تلميح الحركة
EditPosition=الموقع

[OptionsEditorScrollFrame]
StickyLabelAutosizeMaxWidth=عرض الحجم تلقائي الأقصى
StickyLabelHalfPage=نصف الصفحة
StickyLabelHintFollows=تلميح التتبع
StickyLabelPastEndOfFile=لصق في نهايةالملف
StickyLabelPastEndOfLineMarker=النهاية السابقة من علامة السطر
StickyLabelShowHint=إظهار التلميح
StickyLabelShowShadow=إظهار الظل

[OptionsEditorSearchFrame]
StickyLabelDocumentSpecificSearch=Document-بحث معين
StickyLabelHighlightResults=النتائج الابرز
StickyLabelShowSearchMap=إظهار خريطة البحث
ComboBoxAlign=المحاذاة

[OptionsEditorSelectionFrame]
StickyLabelVisible=مرئي
StickyLabelALTSetsColumnMode=ALT تعيين وضع العمود
StickyLabelExpandRealNumbers=توسيع الأعداد الحقيقية
StickyLabelHighlightSimilarTerms=إبراز المصطلحات المشابهة
StickyLabelTermsCaseSensitive=شروط حالة الأحرف
StickyLabelFromEndOfLine=من نهاية السطر
StickyLabelToEndOfLine=الى نهاية السطر
StickyLabelToEndOfLastLine=من نهاية السطر الاخير
StickyLabelTripleClickRowSelect=النقر الثلاثي فوق صف للاختيار

[OptionsEditorSpecialCharsFrame]
StickyLabelUseTextColor=استخدام لون النص
StickyLabelUseMiddleColor=استخدام الألوان المتوسطة
ColorComboBoxColor=لون
ComboBoxStyle=ألاسلوب
GroupBoxEndOfLine=اللون
StickyLabelEndOfLineVisible=مرئي
GroupBoxEndOfLine=اللون
ComboBoxEndOfLineStyle=ألاسلوب
GroupBoxSelection=الاختيار
StickyLabelSelectionVisible=مرئي
ColorComboBoxSelectionColor=اللون

[OptionsEditorSyncEditFrame]
StickyLabelEnabled=مفعل
StickyLabelCaseSensitive=حالة الأحرف
StickyLabelShowActivateIcon=إظهار أيقونة التنشيط

[OptionsEditorTabulatorFrame]
StickyLabelSelectedBlockIndent=اختيارالبادئة المحضورة
StickyLabelColumns=الاعمدة
StickyLabelPreviousLineIndent=سطر البادئة السابقة
StickyLabelTabsToSpaces=اضغط للمسافة
EditWidth=العرض

[OptionsMainMenuFrame]
StickyLabelUseSystemFont=استخدم خط النظام
FontComboBoxFont=الخط
EditFontSize=حجم الخط

[OptionsOutputFrame]
StickyLabelShowTreeLines=اظهر تفرع السطر
StickyLabelShowCheckBox=اظهر صندوق التحقق
EditIndent=قطع

[OptionsPrintFrame]
ComboBoxDocumentName=اسم المستند
ComboBoxPageNumber=رقم  الصفحة
ComboBoxPrintedBy=تم الطبع بواسطة
ComboBoxDateTime=وقت البيانات
StickyLabelShowHeaderLine=اظهر السطر الراسي
StickyLabelShowFooterLine=اظهر السطر الذيلي
StickyLabelShowLineNumbers=اظهر ارقام الاسطر
StickyLabelWordWrap=التواء الكلمة

[OptionsSQLAlignmentsFrame]
ComboBoxKeywordAlign=ترتيب الكلمات الدليلية
StickyLabelKeywordAlignmentLeftJustify=محاذاة الكلمة اليسار التام

[OptionsSQLCapitalizationFrame]
ComboBoxKeywords=كلمات دليلية
ComboBoxIdentifier=المعرف
ComboBoxQuotedIdentifier=اداة  التعريف المقتبسة
ComboBoxTableName=اسم الجدول
ComboBoxColumnName=اسم العمود
ComboBoxAliasName=الاسم المستعار
ComboBoxVariableName=اسم القيم
ComboBoxFunctionName=اسم الوظيفة
ComboBoxDataType=نوع البيانات

[OptionsSQLFormatterFrame]
ComboBoxDatabase=قاعدة البيانات

[OptionsSQLIndentationFrame]
EditIndentLength=طول القطع
StickyLabelUseTab=استخدم مفتاح تنظيم الجدول
EditTabSize=حجم مفتاح تنظيم الجدول
EditFunctionBodyIndent=وظيفة هيكل البادئة
StickyLabelBlockOnNewLine= امنع سطر جديد
EditBlockLeftIndentSize=إمنع حجم يسار البادئة
EditBlockRightIndentSize=إمنع حجم يمين البادئة
EditBlockIndentSize=إمنع حجم البادئة
EditSingleStatementIndent=IF/ELSE بيان واحد حجم البادئة

[OptionsSQLInsertFrame]
ComboBoxColumnListStyle=اسلوب عمود القائمة
ComboBoxValueListStyle=اسلوب قيمة القائمة
EditInsertColumnsPerLine=ادخل اعمدة بين السطر
StickyLabelParenthesisInSeparateLines=الأقواس في خطوط منفصلة

[OptionsSQLSelectFrame]
TabSheetColumnList=عمود القائمة
TabSheetSubquery=فرعي
TabSheetIntoClause=INTO فقرة
TabSheetFromJoinClause=FROM/JOIN فقرة
TabSheetAndOrKeyword=AND/OR كلمة
TabSheetGroupByClause=GROUP BY فقرة
TabSheetHavingClause=HAVING فقرة
TabSheetOrderByClause=ORDER BY فقرة
ComboBoxColumnListStyle=الاسلوب
ComboBoxColumnListLineBreak=كسر خط
StickyLabelAlignAlias=محاذاة الاسم المستعار
StickyLabelColumnInNewLine=الأعمدة في السطر الجديد
StickyLabelTreatDistinctAsVirtualColumn=تعامل مع المميزة كدولة الأعمدة الافتراضية
StickyLabelNewLineAfterIn=IN سطر جديد بعد
StickyLabelNewLineAfterExists=EXISTS سطر جديد بعد
StickyLabelNewlineAfterComparisonOperator=سطر جديد بعد عامل مقارنة
StickyLabelNewlineBeforeComparisonOperator=سطر جديد قبل عامل مقارنة
StickyLabelIntoClauseInNewLine=INTO جملة في الخط الجديد
ComboBoxFromClauseStyle=الاسلوب
StickyLabelFromClauseInNewLine=FROM جملة في الخط الجديد
StickyLabelJoinClauseInNewLine=JOIN جملة في الخط الجديد
StickyLabelAlignJoinWithFromKeyword=محاذاة الانضمام مع من الكلمة
StickyLabelAlignAndOrWithOnInJoinClause=محاذاة AND/OR مع ON في JOIN فقرة
StickyLabelAlignAliasInFromClause=FROM محاذاة الاسم المستعار في البند
ComboBoxAndOrLineBreak=الخط مقطوع
StickyLabelAndOrUnderWhere=و / أو بموجب أين
StickyLabelWhereClauseInNewline=WHERE جملة في الخط الجديد
StickyLabelWhereClauseAlignExpr=WHERE فقرة محاذاة
ComboBoxGroupByClauseStyle=الاسلوب
StickyLabelGroupByClauseInNewLine=GROUP BY جملة في الخط الجديد
StickyLabelHavingClauseInNewLine=HAVING جملة في الخط الجديد
ComboBoxOrderByClauseStyle=الاسلوب
StickyLabelOrderByClauseInNewLine=ORDER BY جملة في الخط الجديد

[OptionsSQLUpdateFrame]
ComboBoxColumnListStyle=اسلوب عمود القائمة

[OptionsSQLWhitespaceFrame]
StickyLabelSpaceAroundOperator=الفراغ حول المشغل للتعبير الحسابي
StickyLabelSpaceInsideCreate=Space inside parenthesis in CREATE FUNCTION/PROCEDURE
StickyLabelSpaceInsideExpression=مساحة الأقواس داخل في التعبير
StickyLabelSpaceInsideSubquery=مساحة الأقواس داخل في الاستعلام الفرعي
StickyLabelSpaceInsideFunction=مساحة الأقواس داخل في استدعاء دالة
StickyLabelSpaceInsideTypename=المساحة داخل الأقواس typename في إنشاء الجدول

[OptionsStatusBarFrame]
StickyLabelUseSystemFont=استخدم خط النظام
FontComboBoxFont=خط
EditFontSize=حجم الخط
StickyLabelShowMacro=عرض المختصر
StickyLabelShowCaretPosition=اظهر مراقبة الموقع
StickyLabelShowKeyState=اظهر حالة المفتاح
StickyLabelShowModified=اظهر التعديل

[OptionsToolbarFrame]
VirtualDrawTree:h=استخدم السحب والاسقاط لتحريك عناصر القائمة. اضغط الزر الايمن لادخال وحذف العناصر.
VirtualDrawTree:0=عناصر القائمة
ActionAddItem=اضف عنصر
ActionAddItem:h=اضف عنصر
ActionDelete=حذف
ActionDelete:h=حذف
ActionAddDivider=اضف مقسما
ActionAddDivider:h=اضافة مقسم
ActionReset=استعادة
ActionReset:h=استعادة عناصر القائمة
ActionMoveUp=تحريك للاعلى
ActionMoveUp:h=حرك العنصر المحدد للاعلى
ActionMoveDown=تحريك للاسفل
ActionMoveDown:h=حرك العنصر المحدد للاسفل

[AboutDialog]
Caption= EditBone حول
LabelVersion=الاصدار %s (%d-bit)
LabelCopyright=الحقوق %s.جميعها محفوظة.
LabelMemoryAvailable=الذاكرة المتاحة للوندوز: %s
LabelDevelopmentEnvironment=مركز التطوير
LabelThirdPartyComponents=3rd مكونات المجموعة
LabelLanguageFileContributors=المساهمون في الترجمة
LabelIcons=الايقونات
ButtonDonations=المتبرعون
ButtonOK=حسنا

[DirectoryTabDialog]
EditTabName=اسم التبويب
EditRootDirectory=مجلد الجذر
GroupBoxOptions=الاختيارات
ComboBoxDrives=التعاريف
ComboBoxFileMask=الملف المخفي
StickyLabelExcludeOtherBranches=تضمين فروع المجلد الاخرى
ButtonCancel=الغاء
ButtonOK=&حسنا

[LanguageEditorForm]
ActionFileNew=جديد
ActionFileNew:h=انشاء ملف لغة جديد
ActionFileOpen=فتح
ActionFileOpen:h=فتح ملف صيغة اللغة
ActionFileSave=حفظ
ActionFileSave:h=حفظ ملف اللغة
ActionExit=خروج
ActionExit:h=اغلاق محرر اللغة
VirtualDrawTree:0=الوظيفة
VirtualDrawTree:1=الشرح
VirtualDrawTree:2=المعلومة
VirtualDrawTree:3=الاختصار

[OptionsForm]
ActionCompare=مقارنة ملفات
ActionDirectory=المجلد
ActionDirectoryTabs=منظم الجداول
ActionEditor=المحرر
ActionEditorCaret=علامة الاقحام
ActionEditorCodeFolding=رمز الطي
ActionEditorColors=الالوان
ActionEditorCompletionProposal=اكمال مشروع
ActionEditorDefaults=الافتراضي
ActionEditorFonts=الخط
ActionEditorLeftMargin=الحد الايسر
ActionEditorMatchingPair=الزوج المطابق
ActionEditorMinimap=خريطة مصغرة
ActionEditorRightMargin=الحد الايمن
ActionEditorScroll=تدوير
ActionEditorSearch=البحث
ActionEditorSelection=التحديد
ActionEditorSpecialChars=رموز خاصة
ActionEditorSyncEdit=تعديل المزامنة
ActionEditorTabs=التبويبات
ActionEditorTabulator=منظم الجداول
ActionFileTypes=انواع الملف
ActionMainMenu=القائمة الرئيسية
ActionOutput=الاخراج
ActionOutputTabs=التبويبات
ActionPrint=طباعة
ActionStatusBar=شريط الحالة
ActionSQLAlignments=الترتيب
ActionSQLCapitalization=القيمة
ActionSQLFormatter=SQL صيغ
ActionSQLIndentation=القطع
ActionSQLInsert=ادخال
ActionSQLSelect=تحديد
ActionSQLUpdate=تحديث
ActionSQLWhitespace=الفضاء الابيض
ActionToolbar=شريط الادوات
ButtonCancel=الغاء
ButtonOK=&حسنا
Caption=الخيارات

[UnicodeCharacterMapForm]
Caption=لوحة الرموز المشفرة

[OptionsDirectoryFrame]
StickyLabelAutoHide=اخفاء تلقائي
StickyLabelShowTreeLines=اظهر تفرعات الاسطر
StickyLabelShowHiddenFiles=اظهر الملفات المخفية
StickyLabelShowSystemFiles=اظهر ملفات النظام
StickyLabelShowArchiveFiles=اظهر الملفات المضغوطة
StickyLabelShowOverlayIcons=عرض ايقونات الغطاء
EditIndent=القطع
ComboBoxAlign=الصف

[OptionsDirectoryTabsFrame]
StickyLabelCloseTabByDblClick=اغلاق التبويب بالضغط المزدوج
StickyLabelCloseTabByMiddleClick=اغلاق التبويب بضغط الوسط
StickyLabelDoubleBuffered=الذاكرة المؤقتة المزدوجة
StickyLabelMultiline=سطر متعدد
StickyLabelSaveTabs=حفظ التبويب
StickyLabelShowCloseButton=اظهر زر الاغلاق
StickyLabelShowOpenDirectoryButton=اظهر زر فتح المجلد
StickyLabelShowImage=اظهر الصورة
StickyLabelRightClickSelect=اختر الزر الايمن

[OptionsEditorDefaultsFrame]
ComboBoxDefaultColor=اللون
ComboBoxDefaultEncoding=التشفير
ComboBoxDefaultHighlighter=الشفافية
ComboBoxDefaultSQLHighlighter=SQL شفافية
EditBrowser=التصفح

[OptionsEditorTabsFrame]
StickyLabelCloseTabByDblClick=Close tab by double-click
StickyLabelCloseTabByMiddleClick=Close tab by middle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelMultiline=Multiline
StickyLabelRightClickSelect=Right click select
StickyLabelSaveTabs=Save Tabs
StickyLabelShowCloseButton=Show close button
StickyLabelShowImage=Show image

[OptionsFileTypesFrame]
EditExtensions=الاختصارات
VirtualDrawTree:0=نوع الملف

[OptionsOutputTabsFrame]
StickyLabelMultiline=سطرمتعدد
StickyLabelShowCloseButton=اظهر زر الاغلاق
StickyLabelShowImage=اظهر الصورة
StickyLabelCloseTabByDblClick=Close tab by double-click
StickyLabelCloseTabByMiddleClick=Close tab by middle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelSaveTabs=Save tabs
StickyLabelRightClickSelect=Right click select

[SQLFormatterConstant]
Stacked=جمع
Wrapped=ملتوي
AfterComma=بعد الفارزة
BeforeComma=قبل الفارزة
BeforeCommaWithSpace=قبل الفارزة مع فراغ
NoLineBreak=سطر مالانهاية
BeforeAndOr=قبل و/او
AfterAndOr=بعد و/او
Left=يسار
Right=يمين
None=لاشئ
Uppercase=كشف الاعلى
Lowercase=كشف الاوطئ
SentenceCase=كشف الجملة
NoChange=لا تغيير

[ConvertConstant]
Distance=المسافة
Micromicrons=الميكرونات الدقيقة
Angstroms=الانغستروم
Millimicrons=ميلي ميكرون
Microns=ميكرون
Millimeters=مليمتر
Centimeters=سنتيمتر
Decimeters=ديسيمتر
Meters=متر
Decameters=ديكامتر
Hectometers=هكتامتر
Kilometers=كيلومتر
Megameters=ميغامتر
Gigameters=غيغامتر
Inches=بوصة
Feet=قدم
Yards=ياردة
Miles=ميل
NauticalMiles=ميل بحري
AstronomicalUnits=الوحدات الفلكية
LightYears=سنة ضوئية
Parsecs=برسيكس
Cubits=المقياس
Fathoms=القامات
Furlongs=الفرلنغ
Hands=يد
Paces=الخطوات
Rods=القضبان
Chains=السلاسل
Links=الخطوط
Picas=الحروف المطبعية
Points=النقاط
Area=المساحة
SquareMillimeters=مليمتر مربع
SquareCentimeters=سنتيمتر مربع
SquareDecimeters=ديسيمتر مربع
SquareMeters=متر مربع
SquareDecameters=ديكامتر مربع
SquareHectometers=هيكتومترمربع
SquareKilometers=كيلومتر مربع
SquareInches=بوصة مربعة
SquareFeet=قدم مربعة
SquareYards=ياردة مربعة
SquareMiles=ميل مربع
Acres=الهكتار
Centares=سنتي هكتار
Ares=هكتار
Hectares=هكتارات
SquareRods=قضبان مربعة
Volume=الحجم
CubicMillimeters=مليمتير مكعب
CubicCentimeters=سنتيمتر مكعب
CubicDecimeters=ديسيمتر مكعب
CubicMeters=متر مكعب
CubicDecameters=ديكامتر مكعب
CubicHectometers=هيكتومتر مكعب
CubicKilometers=كيلومتر مكعب
CubicInches=بوصة مكعبة
CubicFeet=قدم مكعب
CubicYards=ياردة مكعبة
CubicMiles=ميل مكعب
MilliLiters=مليلتر
CentiLiters=سنتيلتر
DeciLiters=ديسيلتر
Liters=لتر
DecaLiters=ديكالتر
HectoLiters=هيكتولتر
KiloLiters=كيلولتر
AcreFeet=قدم هكتار
AcreInches=بوصة هكتار
Cords=الاوتار
CordFeet=قدم وتري
Decisteres=Decisteres
Steres=Steres
Decasteres=Decasteres
FluidGallons=Fluid gallons
FluidPints=Fluid pints
FluidQuarts=Fluid quarts
FluidCups=Fluid cups
FluidGills=Fluid gills
FluidOunces=Fluid ounces
FluidTablespoons=Fluid tablespoons
FluidTeaspoons=Fluid teaspoons
DryGallons=Dry gallons
DryQuarts=Dry quarts
DryPints=Dry pints
DryPecks=Dry pecks
DryBuckets=Dry buckets
DryBushels=Dry bushels
UKGallons=الغالونات البريطانية
UKPottle=UK pottles
UKQuarts=UK quarts
UKPints=UK pints
UKGill=UK gills
UKOunces=الاونصة البريطانية
UKPecks=UK pecks
UKBuckets=UK buckets
UKBushels=UK bushels
Mass=الكتلة
Nanograms=نانوغرام
Micrograms=مايكروغرام
Milligrams=ميليغرام
Centigrams=سينتغرام
Decigrams=ديسيغرام
Grams=غرام
Decagrams=ديكاغرام
Hectograms=هيكتوغرام
Kilograms=كيلوغرام
MetricTons=الطن المتري
Drams=الدراهم
Grains=الحبوب
LongTons=الطن الطويل
Tons=الطن
Ounces=اونصة
Pounds=رطل
Stones=صخرة
NumeralSystem=النظام الرقمي
Binary=ثنائي
Decimal=عشري
Hexadecimal=Hexadecimal
Temperature=درجة الحرارة
Celsius=مئوي
Kelvin=كلفن
Fahrenheit=فهرنهايت
Time=الوقت
Reaumur=Reaumur
Rankine=Rankine
MilliSeconds=ملي ثانية
Seconds=ثواني
Minutes=دقائق
Hours=ساعات
Days=ايام
Weeks=اسابيع
Fortnights=اسبوعين
Months=شهور
Years=سنوات
Decades=عقود
Centuries=قرون
Millennia=الالفية
DateTime=التاريخ
JulianDate=تاريخ جولياني
ModifiedJulianDate=تعديل تاريخ جولياني